<!DOCTYPE html>
<html lang="th">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>ประวัติสำนักงานสาธารณสุขอำเภอห้วยราช</title>
    <style>
        body {

            font-family: 'Arial', sans-serif;
            line-height: 1.6;
            margin: 0;
            padding: 20px;
            background-color: #f4f4f4;
        }
        .container {
            max-width: 1200px;
            margin: 0 auto;
            background-color: #fff;
            padding: 60px;
            border-radius: 8px;
            box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
        }
        h3 {
            color: #355e3b;
            text-align: center;
        }
        p {
            margin: 20px 0;

        }
    </style>
</head>
<body>

    @include('layout.nav')

    <div class="container">
        <h3>ประวัติสำนักงานสาธารณสุขอำเภอห้วยราช</h3><br>

        <p>
            สำนักงานสาธารณสุขอำเภอห้วยราช ตั้งอยู่ที่ หมู่ 3 ถนนสุขาภิบาล ตำบลห้วยราช อำเภอห้วยราช จังหวัดบุรีรัมย์ 31000 โดยเป็นหน่วยงานที่รับผิดชอบในการให้บริการสาธารณสุขแก่ประชาชนในเขตอำเภอห้วยราช รวมถึงการส่งเสริมสุขภาพ การป้องกันโรค การรักษาพยาบาล และการฟื้นฟูสุขภาพของประชาชนทั่วไป
        </p>

        <p>
            สำนักงานสาธารณสุขอำเภอห้วยราช ก่อตั้งขึ้นเพื่อเป็นหน่วยงานที่ให้บริการด้านการแพทย์และสาธารณสุขแก่ประชาชนในพื้นที่ และมีบทบาทสำคัญในการควบคุม กำกับ และสนับสนุนการดำเนินงานทางด้านสาธารณสุขในเขตอำเภอ โดยมุ่งเน้นการให้บริการทางด้านสุขภาพที่ครอบคลุมและเข้าถึงได้สำหรับทุกคน
        </p>

        <p>
            ในช่วงเวลาที่ผ่านมา สำนักงานสาธารณสุขอำเภอห้วยราชได้พัฒนาและขยายการให้บริการสุขภาพแก่ชุมชนอย่างต่อเนื่อง โดยเน้นการป้องกันโรค การส่งเสริมสุขภาพ และการสร้างเสริมความรู้ให้กับประชาชนเกี่ยวกับการดูแลสุขภาพของตนเองและครอบครัว รวมถึงการทำงานร่วมกับโรงพยาบาลประจำอำเภอและโรงพยาบาลส่งเสริมสุขภาพตำบลในพื้นที่ เพื่อให้การบริการด้านสาธารณสุขมีประสิทธิภาพมากยิ่งขึ้น
        </p>

    </div>
    @include('layout.footer')
</body>

</html>
