<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Database\Eloquent\Model;

class BarthelAdl extends Model
{
    protected $table = 'barthel_adls';
    protected $primaryKey = 'ID_ADL';
    protected $fillable = [
        'ID_Elderly', 'Name_Elderly', 'ID_User', 'Name_User', 'Score_ADL', 'Group_ADL',
        'Feeding', 'Grooming', 'Transfer', 'Toilet_use', 'Mobility', 'Dressing',
        'Stairs', 'Bathing', 'Bowels', 'Bladder'
    ];
    public $timestamps = true;

    public function elderly()
    {
        return $this->belongsTo(Elderly::class, 'ID_Elderly', 'ID_Elderly');
    }

    public static function getAdlDescription($category, $score)
    {
        $descriptions = [
            'feeding' => [
                0 => 'ไม่สามารถตักอาหารเข้าปากได้ต้องมีคนป้อนให้',
                1 => 'ตักอาหารเองได้แต่ต้องมีคนช่วย เช่น ช่วยใช้ช้อนตักเตรียมไว้ให้หรือตัดเป็นเล็ก ๆ ไว้ล่วงหน้า',
                2 => 'ตักอาหารและช่วยตัวเองได้เป็นปกติ'
            ],
            'grooming' => [
                0 => 'ต้องการความช่วยเหลือ',
                1 => 'ทำเองได้ (รวมทั้งที่ทำได้เองถ้าเตรียมอุปกรณ์ไว้ให้)'
            ],
            'transfer' => [
                0 => 'ไม่สามารถนั่งได้ (นั่งแล้วจะล้มเสมอ) หรือต้องใช้คนสองคนช่วยกันยกขึ้น',
                1 => 'ต้องการความช่วยเหลืออย่างมากจึงจะนั่งได้ เช่น ต้องใช้คนที่แข็งแรงหรือมีทักษะ 1 คน หรือใช้คนทั่วไป 2 คนพยุงหรือดันขึ้นมาจึงจะนั่งอยู่ได้',
                2 => 'ต้องการความช่วยเหลือบ้าง เช่น บอกให้ทำตาม หรือช่วยพยุงเล็กน้อย หรือต้องมีคนดูแลเพื่อความปลอดภัย',
                3 => 'ทำได้เอง'
            ],
            'toilet_use' => [
                0 => 'ช่วยตัวเองไม่ได้',
                1 => 'ทำเองได้บ้าง (อย่างน้อยทำความสะอาดตัวเองได้หลังจากเสร็จธุระ) แต่ต้องการความช่วยเหลือในบางสิ่ง',
                2 => 'ทำเองได้ดี (ขึ้นนั่งและลงจากโถส้วมเองได้ ทำความสะอาดได้เรียบร้อยหลังจากเสร็จธุระ ถอดใส่เสื้อผ้าได้เรียบร้อย)'
            ],
            'mobility' => [
                0 => 'เคลื่อนที่ไปไหนไม่ได้',
                1 => 'ต้องใช้รถเข็นช่วยตัวเองให้เคลื่อนที่ได้เอง (ไม่ต้องมีคนเข็นให้) และจะต้องเข้าออกมุมห้องหรือประตูได้',
                2 => 'เดินหรือเคลื่อนที่โดยมีคนช่วย เช่น พยุง หรือบอกให้ทำตาม หรือต้องให้ความสนใจดูแลเพื่อความปลอดภัย',
                3 => 'เดินหรือเคลื่อนที่ได้เอง'
            ],
            'dressing' => [
                0 => 'ต้องมีคนสวมให้ ช่วยตัวเองแทบไม่ได้หรือได้น้อย',
                1 => 'ช่วยตัวเองได้ประมาณร้อยละ 50 ที่เหลือต้องมีคนช่วย',
                2 => 'ช่วยตัวเองได้ดี (รวมทั้งการติดกระดุม รูดซิบ หรือใช้เสื้อผ้าที่ดัดแปลงให้เหมาะสมก็ได้)'
            ],
            'stairs' => [
                0 => 'ไม่สามารถทำได้',
                1 => 'ต้องการคนช่วย',
                2 => 'ขึ้นลงได้เอง (ถ้าต้องใช้เครื่องช่วยเดิน เช่น walker จะต้องเอาขึ้นลงได้ด้วย)'
            ],
            'bathing' => [
                0 => 'ต้องมีคนช่วยหรือทำให้',
                1 => 'อาบน้ำเองได้'
            ],
            'bowels' => [
                0 => 'กลั้นไม่ได้ หรือต้องการการสวนอุจจาระอยู่เสมอ',
                1 => 'กลั้นไม่ได้บางครั้ง (เป็นน้อยกว่า 1 ครั้งต่อสัปดาห์)',
                2 => 'กลั้นได้เป็นปกติ'
            ],
            'bladder' => [
                0 => 'กลั้นไม่ได้ หรือใส่สายสวนปัสสาวะแต่ไม่สามารถดูแลเองได้',
                1 => 'กลั้นไม่ได้บางครั้ง (เป็นน้อยกว่าวันละ 1 ครั้ง)',
                2 => 'กลั้นได้เป็นปกติ'
            ]
        ];
        return $descriptions[$category][$score];
    }
}
